/* =====================================================================================================================
 * File: udp.h
 * Description: UDP клиент
 * Author: soltanoff
 * ================================================================================================================== */
#ifndef CLIENT_UDP_H
#define CLIENT_UDP_H
/* ================================================================================================================== */
#include "../../config/config.h"
#include "../client.h"
/* ================================================================================================================== */
class CUDPClient: IClient {
public:
    CUDPClient();

    ~CUDPClient();

    /*!
     * @public Основной циклический метод класса.
     * @return 0 если работа завершилась без аварий, иначе -1
     * @note основной метод для взаимодействия с сервером
     */
    void exec();
protected:
    /*!
     * @protected Метод осуществляющий привязку и прослушку сокета
     * @return true если открыть сокет получилось, иначе false
     */
    bool prepareClient();

    /*!
     * @private Метод обработки ответа от сервера
     * @param receivedBytes - количество полученных байт от сервера (out)
     * @param receivedBuf - массив данных, содержащий ответ от сервера (out)
     * @return true - данные получены успешно, инче false
     * @note осуществляет обработку полученного ответа сервера
     */
    bool getAnswer(std::uint32_t &receivedBytes, char *receivedBuf);

    /*!
     * @private Метод отправки данных на сервер
     * @param msg - массив данных отправляемых на сервер
     * @return true - данные отправленны успешно, иначе false
     * @note осуществляет отправку обработанных данных пользователя на сервер
     */
    bool sendMessage(const char *msg);
};


#endif /* CLIENT_UDP_H */
