/* =====================================================================================================================
 * File: listener.h
 * Description: Лисенер
 * Author: soltanoff
 * ================================================================================================================== */
#ifndef SERVER_LISTENER_H
#define SERVER_LISTENER_H
/* ================================================================================================================== */
#include "../config/config.h"
/* ================================================================================================================== */
class IListener {
public:
    IListener() = default;

    virtual ~IListener() = default;

    /*!
     * @public Метод закрывающий сокет сервера.
     * @return None
     * @note закрытие сокета с параметром SHUT_WR
     */
    virtual void close() = 0;

    /*!
     * @public Основной циклический метод класса.
     * @note основной метод для взаимодействия сервера с клиентами
     */
    virtual void exec() = 0;
protected:
    //! @protected сокет открытого подключения
    SOCKET _socket;
    //! @protected структура конфигураций подключения сети
    sockaddr_in _service;

    /*!
     * @protected Метод осуществляющий привязку и прослушку сокета
     * @return true если открыть сокет получилось, иначе false
     */
    virtual bool prepareListener() { return true; };
};
#endif /* SERVER_LISTENER_H */
