/* =====================================================================================================================
 * File: config.h
 * Description: Файл основных конфигураций
 * Author: soltanoff
 * ================================================================================================================== */
#ifndef CONFIG_H
#define CONFIG_H
/* ================================================================================================================== */
#include <vector>
#include <time.h>
#include <string>
#include <cstring>
#include <iostream>
#include <sys/types.h>
#include <sys/socket.h>
#include <netinet/in.h>
#include <arpa/inet.h>
#include <thread>
#include <mutex>
/* ================================================================================================================== */
#define SOCKET int
#define SOCKET_ERROR -1
/*!
 * @namespace ServerCfg
 * Основные константы конфигурации сервера
 */
namespace ServerCfg {
    //! локальный ip-адрес сервера
    const char LOCALHOST[] = "127.0.0.1";
    //! используемый порт сервера [TCP]
    const std::uint16_t TCP_PORT = 8082;
    //! тип протокола сервера [TCP]
    const std::uint16_t TCP_PROTOCOL = IPPROTO_TCP;
    //! используемый порт сервера [UDP]
    const std::uint16_t UDP_PORT = 8083;
    //! тип протокола сервера [UDP]
    const std::uint16_t UDP_PROTOCOL = IPPROTO_UDP;
    //! размер буфера отправляемых и получаемых данных
    const std::uint16_t BUFF_SIZE = 64000;
}
/* ================================================================================================================== */
/*!
 * @private Метод осуществляющий контроль ввода ответа пользователя на булевый вопрос
 * @param answer - ответ пользователя на вопрос [Y,N]
 * @return None
 * @note организовывается ввод ответа пользователя и дальнейшая его проверка ответа на корректность
 */
void answerControl(char *answer, const char var_1 = 'Y', const char var_2 = 'N');
/*!
 * @private Метод осуществляющий контроль ввода ip-адреса сервера
 * @param ip - корректно введенный пользователем ip-адрес (out)
 * @return None
 * @note организовывается ввод ip-адреса и дальнейшая его проверка на корректность
 */
void ipAddressControl(char *ip);
/* ================================================================================================================== */
#endif /* CONFIG_H */
